Tekla Open API Reference for Tekla Structures 2025
Assembly.SetUserDefinedCoordSys Method
 Set user defined assembly coordinate system. If set, GetCoordinateSystem will return this value.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetUserDefinedCoordSys(
	CoordinateSystem coordinateSystem
)
Public Function SetUserDefinedCoordSys (
	coordinateSystem As CoordinateSystem
) As Boolean
Parameters
coordinateSystem
Type: Tekla.Structures.Geometry3d.CoordinateSystem
The coordinate system.
Return Value
Type: Boolean
True if successful.
Remarks
Currently only supported with rebar assemblies.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace